Неба утреннего стяг
В жизни важен первый шаг.
Слышишь, реют над страною
Вихри яростных атак.

И вновь продолжается бой!
И сердцу тревожно в груди.
И Ленин такой молодой,
И юный Октябрь впереди!
И Ленин такой молодой,
И юный Октябрь впереди!

Песнь летит во все концы,
Вы поверьте нам, отцы!
Будут новые победы
Встанут новые бойцы.

И вновь продолжается бой!
И сердцу тревожно в груди.
И Ленин такой молодой,
И юный Октябрь впереди!
И Ленин такой молодой,
И юный Октябрь впереди!

Через зной и снегопад,
Мир и беден, и богат.
С нами юность всей планеты,
Наш всемирный стройотряд.

И вновь продолжается бой!
И сердцу тревожно в груди.
И Ленин такой молодой,
И юный Октябрь впереди!
И Ленин такой молодой,
И юный Октябрь впереди!

С неба милости не жди,
Жизнь для правды не щади.
Нам, ребята, в этой жизни,
Только с правдой по пути.

И вновь продолжается бой!
И сердцу тревожно в груди
И Ленин такой молодой
И юный Октябрь впереди!
И Ленин такой молодой,
И юный Октябрь впереди!

И вновь продолжается бой!
И сердцу тревожно в груди
И Ленин такой молодой
И юный Октябрь впереди!
И Ленин такой молодой,
И юный Октябрь впереди!